Repository: 84000/data-translation-memory
Catalog: toh68_84000-ascertaining-the-vinaya-upali-s-questions.tmx
Source language: bo
Languages: en

source: །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམ་པར་རྨོངས་པ་རྣམས་ལ་ཡང་དག་པའི་ཆོས་རྗེས་སུ་རྟོགས་པར་བྱ་བའི་ཕྱིར་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་རིག་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་ཐར་པ་ཉེ་བར་སྟོན་པར་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་ལས་མི་གཡོའོ།
en: “Śāriputra, bodhisattva mahāsattvas demonstrate liberation to ordinary, deluded, childish beings by using various forms of knowledge that align with their inclinations and thus bring them to an understanding of the true Dharma. And yet, they never waver from their bodhisattva nature.

source: །རིམ་གྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་སྒྱུ་མའི་བཀོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱང་ཉེ་བར་སྟོན་ཏོ།
en: They display various types of illusion in order cause beings to progressively reach the seat of awakening.

source: །ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱིམ་པ་ཁྱིམ་ན་གནས་པས་ནི་སྦྱིན་པ་གཉིས་ལ་གནས་པར་བྱའོ། །གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Furthermore, Śāriputra, lay householder bodhisattva mahāsattvas should practice two types of giving:

source: ཆོས་སྦྱིན་པ་དང་། ཟང་ཟིང་སྦྱིན་པ་སྟེ།
en: giving the Dharma and giving material goods.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱིམ་པ་ཁྱིམ་ན་གནས་པས་ནི་རྗེས་སུ་ཆགས་པ་མེད་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པས་སྦྱིན་པ་དེ་གཉིས་ལ་གནས་པར་བྱའོ།
en: Śāriputra, lay householder bodhisattva mahāsattvas should practice these two types of giving without attachment or anger.

source: །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་བྱུང་བར་གཏོགས་པས་ནི་སྦྱིན་པ་བཞི་ལ་གནས་པར་བྱའོ། །བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྨྱུག་གུ་སྦྱིན་པ་དང་། སྣག་ཚ་སྦྱིན་པ་དང་། གླེགས་བམ་སྦྱིན་པ་དང་། ཆོས་སྦྱིན་པ་སྟེ།
en: “Śāriputra, renunciant bodhisattva mahāsattvas should engage in four types of giving: giving pens, giving ink, giving books, and giving the Dharma.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་བྱུང་བར་གཏོགས་པས་ནི་སྦྱིན་པ་བཞི་པོ་དེ་དག་ལ་གནས་པར་བྱའོ།
en: Śāriputra, renunciant bodhisattva mahāsattvas should practice these four types of giving.

source: །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པས་ནི་གཏོང་བ་གསུམ་ལ་གནས་པར་བྱའོ། །གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Śāriputra, bodhisattva mahāsattvas who have accepted that phenomena are unproduced should practice three types of relinquishment:

source: གཏོང་བ་དང་། གཏོང་བ་ཆེན་པོ་དང་། ཤིན་ཏུ་གཏོང་བ་ལའོ།
en: relinquishment, great relinquishment, and the highest relinquishment.

source: །དེ་ལ་གཏོང་བ་ནི་རྒྱལ་སྲིད་ཡོངས་སུ་གཏོང་བའོ།
en: With respect to these, “relinquishment” means to give away the kingdom;

source: །གཏོང་བ་ཆེན་པོ་ནི་ཆུང་མ་དང་། བུ་དང་། བུ་མོ་ཡོངས་སུ་གཏོང་པའོ།
en: “great relinquishment” is to give away one’s wives, sons, and daughters;

source: །ཤིན་ཏུ་གཏོང་བ་ནི་མགོ་དང་། ལག་པ་དང་། རྐང་པ་དང་། མིག་དང་། པགས་པ་དང་། རུས་པ་དང་། རྐང་ཡོངས་སུ་གཏོང་བ་སྟེ།
en: and the “greatest relinquishment” is to give away one’s own head, hands, feet, eyes, skin, bones, and marrow.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པས་ནི་ཡོངས་སུ་གཏོང་བ་གསུམ་པོ་དེ་དག་ལ་གནས་པར་བྱའོ། །ཤཱ་རིའི་བུས་གསོལ་པ།
en: Śāriputra, a bodhisattva mahāsattva who has accepted that phenomena are unproduced should practice these three types of relinquishment.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འདོད་ཆགས་ཀྱིས་མི་འཇིགས་ལགས་སམ།
en: Śāriputra asked, “Bhagavān, are bodhisattvas not afraid of desire?

source: ཞེ་སྡང་དང་། གཏི་མུག་གིས་མི་འཇིགས་ལགས་སམ།
en: Are they not afraid of anger and delusion?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཁ་ན་མ་ཐོ་བ་ཆེན་པོ་དང་བཅས་པའི་ཉེས་པ་ནི་གཉིས་ཏེ། གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: The Bhagavān replied, “Śāriputra, the faults associated with the great misdeeds of bodhisattvas are twofold:

source: ཞེ་སྡང་དང་ལྡན་པ་དང་། གཏི་མུག་དང་ལྡན་པ་སྟེ།
en: those related to anger and those related to delusion.

source: ཤཱ་རིའི་བུ་གཉིས་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཁ་ན་མ་ཐོ་བ་ཆེན་པོ་དང་བཅས་པའི་ཉེས་པ་ཡིན་ནོ།
en: Śāriputra, these are the two faults associated with the great misdeeds of bodhisattvas.

source: །ཤཱ་རིའི་བུ་དེ་ལ་འདོད་ཆགས་ནི་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཆུང་ལ་འབྲལ་བ་བུལ་བ་ཡིན་ནོ།
en: “Śāriputra, among these, desire is a minor misdeed and is given up slowly.

source: །ཞེ་སྡང་ནི་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཆེ་ལ་འབྲལ་བ་མྱུར་བ་ཡིན་ནོ།
en: Anger is a major misdeed and is given up quickly.

source: །གཏི་མུག་ནི་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཆེ་ལ་འབྲལ་བ་བུལ་བ་ཡིན་ནོ།
en: Delusion is a major misdeed and is given up slowly.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: ཤཱ་རིའི་བུ་འདོད་ཆགས་ནི་འཁོར་བའི་འཁྲི་ཤིང་ཀུན་ཏུ་འཛིན་པའི་ཕྱིར་ཉིང་མཚམས་སྦྱོར་བའི་ས་བོན་ཡིན་པ་དང་། ཞེ་སྡང་ནི་མྱུར་དུ་ཡོངས་སུ་སྤོང་བའི་ཕྱིར་ངན་སོང་དུ་འགྲོ་བའི་རྒྱུར་གྱུར་པ་ཡིན་པ་དང་། གཏི་མུག་ནི་རྣམ་པར་འགྲོལ་བར་དཀའ་བའི་ཕྱིར་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བརྒྱད་དུ་རབ་ཏུ་ལྟུང་བའི་རྒྱུར་གྱུར་པ་ཡིན་པའི་ཕྱིར་རོ།
en: Śāriputra, desire is the ensnaring vine of saṃsāra and thus the seed of rebirth. Anger is eliminated quickly and is the cause of unfortunate rebirths. Delusion is difficult to relinquish and is the cause of falling into the eight great hells.

source: །ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་ཉེས་པ་དང་པོའི་ལྕི་བ་ནི་ཚོགས་བཅུ་ལ་དྲང་པོར་བཤགས་པར་བྱའོ། །བུད་མེད་ཀྱི་ལག་པ་ནས་འཛིན་པའི་ལག་པའི་ཉེས་པ་ལྕི་བ་ནི་ཚོགས་ལྔ་ལ་བཤགས་པར་བྱའོ།
en: “Regarding these, Śāriputra, a bodhisattva should openly confess the weightiest of faults to an assembly of ten. A weighty fault of the hand—that is, grasping a woman’s hand—should be confessed to an assembly of five.

source: །ཉོན་མོངས་པ་ཅན་གྱི་སེམས་ཀྱིས་མིག་གིས་བལྟས་པའི་ཉེས་པ་ནི་གང་ཟག་གཅིག་གམ། གཉིས་ཀྱི་མདུན་དུ་བཤགས་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔས་མཚམས་མེད་པ་ལྔ་དང་ལྡན་པའི་ཉེས་པ་དང་། བུད་མེད་ཀྱི་ཉེས་པ་དང་། ཁྱེ་འུའི་ཉེས་པ་དང་། ལག་པའི་ཉེས་པ་དང་། མཆོད་རྟེན་གྱི་ཉེས་པ་དང་། དགེ་འདུན་གྱི་ཉེས་པ་དང་། དེ་ལས་གཞན་པའི་ཉེས་པ་ལྕི་བ་རྣམས་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུམ་ཅུ་རྩ་ལྔའི་སྤྱན་སྔར་གཅིག་པུས་ཉིན་མཚན་དུ་བཤགས་པར་བྱའོ།
en: The fault of looking at a woman with ill intent should be confessed before one or two people. A bodhisattva should confess the faults associated with the five grave acts of immediate retribution, faults related to women, faults related to boys, faults related to the hand, faults related to stūpas, faults related to the saṅgha, or any other weighty fault before the thirty-five bhagavān buddhas, doing so on their own throughout the day and night.

source: །དེ་ལ་བཤགས་པ་ནི་འདི་ཡིན་ཏེ། བདག་མིང་འདི་ཞེས་བགྱི་བ།
en: The confession is as follows:

source: སངས་རྒྱས་ལ་སྐྱབས་སུ་མཆིའོ།
en: “ ‘I seek refuge in the Buddha,

source: །ཆོས་ལ་སྐྱབས་སུ་མཆིའོ།
en: I seek refuge in the Dharma,

source: །དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ།
en: I seek refuge in the Saṅgha.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་ཕྱག་འཚལ་ལོ།
en: “ ‘I pay homage to the tathāgata, the arhat, the completely perfect Buddha Śākyamuni!

source: །རྡོ་རྗེའི་སྙིང་པོས་རབ་ཏུ་འཇོམས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Vajra­garbha­pramardin.

source: །རིན་ཆེན་འོད་འཕྲོ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Ratnārcis.

source: །ཀླུ་དབང་གི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Nāgeśvara­rāja.

source: །དཔའ་བོའི་སྡེ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Vīrasena.

source: །དཔལ་དགྱེས་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Vīranandin.

source: །རིན་ཆེན་མེ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Ratnāgni.

source: །རིན་ཆེན་ཟླ་འོད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Ratna­candra­prabha.

source: །མཐོང་བ་དོན་ཡོད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Amoghadarśin.

source: །རིན་ཆེན་ཟླ་བ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Ratnacandra.

source: །དྲི་མ་མེད་པ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Vimala.

source: །དཔས་བྱིན་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Śūradatta.

source: །ཚངས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Brahmā

source: །ཚངས་པས་བྱིན་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Brahma­datta.

source: །ཆུ་ལྷ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Varuṇa.

source: །ཆུ་ལྷའི་ལྷ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Varuṇadeva.

source: །དཔལ་བཟངས་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Bhadraśrī.

source: །ཙན་དན་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Candanaśrī.

source: །གཟི་བརྗིད་མཐའ་ཡས་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Anantaujas.

source: །འོད་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Prabhāsa­śrī.

source: །མྱ་ངན་མེད་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Aśokaśrī.

source: །སྲེད་མེད་ཀྱི་བུ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Nārāyaṇa

source: །མེ་ཏོག་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Kusumaśrī.

source: །དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་འོད་ཟེར་རྣམ་པར་རོལ་པས་མངོན་པར་མཁྱེན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to the Tathāgata Brahma­jyotir­vikrīḍitābhijña.

source: །དེ་བཞིན་གཤེགས་པ་པད་མའི་འོད་ཟེར་རྣམ་པར་རོལ་པས་མངོན་པར་མཁྱེན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to the Tathāgata Padma­jyotir­vikrīḍitābhijña.

source: །ནོར་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Dhanaśrī.

source: །དྲན་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Smṛtiśrī.

source: །མཚན་དཔལ་ཤིན་ཏུ་ཡོངས་བསྒྲགས་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Suparikīrtita­nāmadheya­śrī.

source: །དབང་པོ་ཏོག་གི་རྒྱལ་མཚན་གྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Indra­ketu­dhvaja­rāja.

source: །ཤིན་ཏུ་རྣམ་པར་གནོན་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Suvikrānta­śrī.

source: །གཡུལ་ལས་ཤིན་ཏུ་རྣམ་པར་རྒྱལ་བ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Suvijita­saṃgrāma.

source: །རྣམ་པར་གནོན་པས་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Vikrānta­gāmin.

source: །ཀུན་ནས་སྣང་བ་བཀོད་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Samantāvabhāsa­vyūha­śrī.

source: །རིན་ཆེན་པད་མས་རྣམ་པར་གནོན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Ratna­padma­vikrāmin.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་པད་མ་ལ་རབ་ཏུ་བཞུགས་པ་རི་དབང་གི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to the tathāgata, the arhat, the completely perfect Buddha Ratna­padma­supratiṣṭhita­śailendra­rāja.

source: །དེ་དག་ལ་སོགས་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་བདག་ལ་དགོངས་སུ་གསོལ།
en: “ ‘To them, and to all the other tathāgata, arhat, and completely perfect buddhas who dwell, live, and endure in all realms throughout the ten directions—to those blessed buddhas, I pray, please pay heed to me!

source: བདག་གིས་སྐྱེ་བ་འདི་དང་། སྐྱེ་བ་ཐོག་མ་དང་། ཐ་མ་མ་མཆིས་པ་ནས་འཁོར་བ་ན་འཁོར་བའི་སྐྱེ་བ་གཞན་དག་ཏུ་སྡིག་པའི་ལས་བགྱིས་པ་དང་། བགྱིད་དུ་སྩལ་བ་དང་། བགྱིད་པ་ལ་རྗེས་སུ་ཡི་རང་བ་འམ། མཆོད་རྟེན་གྱི་དཀོར་རམ། དགེ་འདུན་གྱི་དཀོར་རམ།
en: “ ‘In this and in all the other births that I have taken in saṃsāra without beginning or end, I have committed evil actions, I have asked others to commit them, or have rejoiced when they were committed.

source: ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་ཕྲོགས་པ་དང་། འཕྲོག་ཏུ་སྩལ་བ་འམ། འཕྲོགས་པ་ལ་རྗེས་སུ་ཡི་རང་བའམ།
en: “ ‘I have stolen the property of stūpas, the property of the saṅgha, or the property of the saṅghas of the four directions, have made others steal them, or have rejoiced when they were stolen.

source: མཚམས་མ་མཆིས་པ་ལྔའི་ལས་བགྱིས་པ་དང་། བགྱིད་དུ་སྩལ་བ་དང་། བགྱིད་པ་ལ་རྗེས་སུ་ཡི་རང་བའམ།
en: “ ‘I have committed the five grave acts of immediate retribution, have made others commit them, or have rejoiced when they were committed.

source: མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླང་བ་ལ་ཞུགས་པ་དང་། འཇུག་ཏུ་སྩལ་བ་དང་། འཇུག་པ་ལ་རྗེས་སུ་ཡི་རང་བ་འམ།
en: “ ‘I have taken the path of the ten nonvirtuous actions, have made others take it, or have rejoiced in their taking it.

source: ལས་ཀྱི་སྒྲིབ་པ་གང་གིས་བསྒྲིབས་ནས་བདག་སེམས་ཅན་དམྱལ་བར་མཆི་བའམ། དུད་འགྲོའི་སྐྱེ་གནས་སུ་མཆི་བ་འམ། ཡི་དགས་ཀྱི་ཡུལ་དུ་མཆི་བའམ། ཡུལ་མཐའ་འཁོབ་ཏུ་སྐྱེ་བ་འམ། ཀླ་ཀློར་སྐྱེ་བའམ། ལྷ་ཚེ་རིངས་པོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བ་འམ། དབང་པོ་མ་ཚང་བར་འགྱུར་བ་འམ། ལྟ་བ་ལོག་པ་འཛིན་པར་འགྱུར་བའམ།
en: “ ‘Having been affected by karmic obscurations, I will go to the hells, I will go to the animal realm, I will go to the preta realm, I will be born among barbarians in a border region, I will be born among the long-lived devas, I will have incomplete faculties, I will hold false views, or I will not be able to delight in the appearance of a buddha in the world.

source: སངས་རྒྱས་འབྱུང་བ་ལ་མཉེས་པར་མི་བགྱིད་པར་འགྱུར་བའི་ལས་ཀྱི་སྒྲིབ་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡེ་ཤེས་སུ་གྱུར་པ། སྤྱན་དུ་གྱུར་པ། དཔང་དུ་གྱུར་པ། ཚད་མར་གྱུར་པ། མཁྱེན་པ།
en: “ ‘All these karmic obscurations I confess in the presence of the bhagavān buddhas, who are wise, who have vision, who witness, who are authoritative, and who know and see. I reveal these actions; I do not conceal them, and I will henceforth show restraint. “ ‘May those bhagavān buddhas pay heed to me!

source: གཟིགས་པ་དེ་དག་གི་སྤྱན་སྔར་མཐོལ་ལོ་འཆགས་སོ། །མི་འཆབ་བོ། །སླན་ཆད་ཀྱང་སྡོམ་པར་བགྱིད་ལགས་སོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བདག་ལ་དགོངས་སུ་གསོལ། བདག་གིས་སྐྱེ་བ་འདི་དང་། སྐྱེ་བ་ཐོག་མ་དང་། ཐ་མ་མ་མཆིས་པ་ནས་འཁོར་བ་ན་འཁོར་བའི་སྐྱེ་བ་གཞན་དག་ཏུ་སྦྱིན་པ་ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་ལ་ཟས་ཁམ་གཅིག་ཙམ་སྩལ་བ་གང་ལགས་པ་དང་། བདག་གིས་ཚུལ་ཁྲིམས་བསྲུངས་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། བདག་གིས་ཚངས་པར་སྤྱོད་པ་ལ་གནས་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། བདག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིས་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། བདག་གི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། བདག་གི་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ཤིང་བཟླུམས་ཏེ་བསྡོམས་ནས་བླ་ན་མ་མཆིས་པ་དང་། གོང་ན་མ་མཆིས་པ་དང་། གོང་མའི་ཡང་གོང་མར་ཡོངས་སུ་བསྔོ་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ།
en: “ ‘In this and in all the other births that I have taken in saṃsāra without beginning or end, whatever gifts I have given, even if just a small bit of food to an animal, whatever roots of virtue I may possess from maintaining discipline, whatever roots of virtue I may possess from chaste conduct, whatever roots of virtue I may possess by bringing beings to maturity, whatever roots of virtue I may possess through the mind of awakening, and whatever roots of virtue I may possess through unsurpassed gnosis, I collect, combine, and coalesce all of it and dedicate it to unsurpassed, completely perfect awakening by making unsurpassable, unexcelled, and supreme dedications.

source: །ཇི་ལྟར་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཡོངས་སུ་བསྔོས་པ་དང་། ཇི་ལྟར་མ་འོངས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཡོངས་སུ་བསྔོ་བར་འགྱུར་བ་དང་། ཇི་ལྟར་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ད་ལྟར་ཡོངས་སུ་སྔོ་བར་མཛད་པ་དེ་ལྟར་བདག་གིས་ཀྱང་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ།
en: “ ‘Just as the bhagavān buddhas of the past have dedicated, just as the bhagavān buddhas of the future will dedicate, and just as the bhagavān buddhas of the present now dedicate, in the same way, I also dedicate the virtue.

source: །སྡིག་པ་ཐམས་ཅད་འཆགས་སོ། །བསོད་ནམས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཡི་རང་ངོ་།
en: I confess all evil actions. I rejoice in all merit.

source: །སངས་རྒྱས་ཐམས་ཅད་ལ་གསོལ་བ་འདེབས་སོ།
en: I supplicate all buddhas. May my gnosis be unsurpassed. “ ‘With folded hands I seek refuge

source: །བདག་གི་ཡེ་ཤེས་བླ་ན་མེད་པའི་མཆོག་ཏུ་གྱུར་ཅིག །མི་མཆོག་རྒྱལ་བ་གང་དག་ད་ལྟར་བཞུགས་པ་དང་། །གང་དག་འདས་པ་དག་དང་དེ་བཞིན་གང་མ་བྱོན།
en: In all the conquerors, the most supreme beings Of the present, of the past, and who have not yet come,

source: །ཡོན་ཏན་བསྔགས་པ་མཐའ་ཡས་རྒྱ་མཚོ་འདྲ་ཀུན་ལ། །ཐལ་མོ་སྦྱར་བ་བགྱིས་ཏེ་སྐྱབས་སུ་ཉེ་བར་མཆིའོ།
en: Who possess an ocean of qualities limitless and praiseworthy.’

source: །ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུམ་ཅུ་རྩ་ལྔ་པོ་དེ་དག་ལ་སོགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དག་གིས་སྡིག་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱའོ།
en: “Śāriputra, in the same way, a bodhisattva should follow all tathāgatas in contemplating the thirty-five bhagavān buddhas and the rest, and thereby purify all their evil actions.

source: །དེ་ལྟར་སྡིག་པ་ཐམས་ཅད་རྣམ་པར་དག་པ་དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཉིད་ཀྱང་སེམས་ཅན་རྣམ་པར་ཐར་པར་བྱ་བ་ཁོ་ནའི་ཕྱིར་ཞལ་ཉེ་བར་སྟོན་པར་མཛད་དོ།
en: “Similarly, for the sole purpose of liberating beings, those very bhagavān buddhas reveal themselves directly to those who purify all evil actions.

source: །དེ་བཞིན་དུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འཁྲུལ་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཚིག་འབྲུ་རྣམ་པ་སྣ་ཚོགས་ཉེ་བར་སྟོན་པར་མཛད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལས་ཀྱང་མི་གཡོ་ལ་སེམས་ཅན་མོས་པ་སྣ་ཚོགས་དང་ལྡན་པ་རྣམས་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་ཐར་བར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་ཡང་མཛད་དོ།
en: They likewise teach confused, foolish beings using a variety of words in order to bring them to maturity, all without wavering from the dharmadhātu. They make perfect aspirations for the sake of liberating beings, liberating each according to their own predispositions.

source: །ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ལྷ་མ་ཡིན་གྱི་འགྲོ་བ་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: “Śāriputra, bodhisattva mahāsattvas who have entered into the samādhi of great compassion appear in the form of hell beings, animals, beings in the world of Yama, and asuras for the sake of bringing beings to maturity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཀོད་པ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཁྱིམ་བདག་གི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: Bodhisattva mahāsattvas who have entered into the samādhi of great array appear in the form of householders for the sake of bringing beings to maturity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆོག་གི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འཁོར་ལོས་སྒྱུར་བའི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: Bodhisattva mahāsattvas who have entered into the supreme samādhi appear in the form of cakravartins for the sake of bringing beings to maturity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟི་བརྗིད་དྲག་པོའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བརྒྱ་བྱིན་དང་། ཚངས་པའི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: Bodhisattva mahāsattvas who have entered into the samādhi of intense brilliance appear in the forms of Indra and Brahmā for the sake of bringing beings to maturity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩེ་གཅིག་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཉན་ཐོས་ཀྱི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: Bodhisattva mahāsattvas who have entered into the single-pointed samādhi appear in the form of śrāvakas for the sake of bringing beings to maturity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་པ་གཉིས་སུ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རང་སངས་རྒྱས་ཀྱི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: Bodhisattva mahāsattvas who have entered into the samādhi of nondual purity appear in the form of pratyekabuddhas for the sake of bringing beings to maturity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: Bodhisattva mahāsattvas who have entered into the samādhi of peace appear in the form of completely perfect buddhas for the sake of bringing beings to maturity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དེ།
en: Bodhisattva mahāsattvas who have entered into the samādhi mastery of all phenomena appear in forms aligned with various predispositions for the sake of bringing beings to maturity.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་སྐྱེས་བུ་དམ་པ་རྣམས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ལ་ལར་ནི་བརྒྱ་བྱིན་གྱི་གཟུགས། ལ་ལར་ནི་ཚངས་པའི་གཟུགས། ལ་ལར་ནི་འཁོར་ལོས་སྒྱུར་བའི་གཟུགས་ཉེ་བར་སྟོན་པར་ཡང་བྱེད་ལ། ཆོས་ཀྱི་དབྱིངས་ལས་ཀྱང་མི་གཡོའོ།
en: “Śāriputra, in that way, for the sake of bringing beings to maturity, holy beings sometimes appear in the form of Indra, sometimes in the form of Brahmā, and sometimes in the form of a cakravartin, all without wavering from the dharmadhātu.

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་མོས་པ་སྣ་ཚོགས་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་རྣམ་པར་རིག་པའི་གཟུགས་རྣམ་པ་སྣ་ཚོགས་ཉེ་བར་སྟོན་པར་བྱེད་ཀྱང་དེ་ལ་བདག་ཏུ་དམིགས་པ་ཡང་མེད། སེམས་ཅན་དུ་དམིགས་པ་ཡང་མེད་ལ་སེམས་ཅན་རྣམས་ལ་འགྲོ་བ་སྣ་ཚོགས་ཀྱི་གཟུགས་ཉེ་བར་སྟོན་པར་ཡང་བྱེད་པའི་ཕྱིར་རོ།
en: Bodhisattvas, for the sake of bringing beings to maturity, appear to beings of different predispositions in a variety of recognizable forms, but the bodhisattvas objectify neither themselves nor beings as they appear in various forms to those beings.

source: །ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Śāriputra, what do you think?

source: རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེའི་སྒྲ་སྐད་གང་ཡིན་པ་དེ་བྱི་ལས་བཟོད་པར་ནུས་སྙམ་འམ།
en: Can a cat withstand the roar of a lion, the king of beasts?”

source: ཤཱ་རིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མི་བཟོད་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Śāriputra replied, “Bhagavān, it cannot withstand it.”

source: ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: The Bhagavān said, “Śāriputra, what do you think?

source: སྤོས་ཀྱི་གླང་པོ་ཆེའི་ཁལ་གང་ཡིན་པ་དེ་བོང་བུས་བཟོད་པར་ནུས་སྙམ་འམ།
en: Can a donkey bear the load of a great rutting elephant?”

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དག་གི་གཟི་བརྗིད་ཀྱི་བདག་པོ་གང་ཡིན་པ་དེ་མི་དབུལ་པོས་བཟོད་པར་ནུས་སྙམ་འམ།
en: Can poor people endure the lordly magnificence of Indra and Brahmā?”

source: ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས་བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་གི་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་བྱ་རྒོད་ཀྱི་ཕྲུག་གུས་བཟོད་པར་ནུས་སྙམ་འམ།
en: The Bhagavān said, “Śāriputra, what do you think? Can a fledgling vulture withstand the attack of a garuḍa, the king of birds?”

source: ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་དཔའ་དང་། དགེ་བའི་རྩ་བའི་སྟོབས་བསྐྱེད་པ་ལས་བྱུང་ཞིང་ཤེས་པ་ལས་ངེས་པར་བྱུང་བའི་ཉེས་པ་གང་ཡིན་པ་དང་། ཉེས་པ་འགྱོད་པའི་གནས། སངས་རྒྱས་མཐོང་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པ་ཐོབ་པས་རྣམ་པར་སྦྱོང་བ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་སྦྱོང་བར་མི་ནུས་སོ།
en: “Similarly Śāriputra, no ordinary being or follower of the Śrāvakayāna or Pratyekabuddhayāna is able to purify the faults of bodhisattvas that have arisen from the power of their courageous mind and roots of virtue or from their knowledge, nor can they purify pernicious faults, which are purified by entering the samādhi of seeing the buddhas

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་འཛིན་ཅིང་ཡོངས་སུ་བརྗོད་པ་དང་། ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་བརྗོད་པས་ཉེས་པ་བགྱིད་པའི་གནས་ལས་ངེས་པར་འབྱུང་ཞིང་ཏིང་ངེ་འཛིན་ཀྱང་ཐོབ་པར་འགྱུར་རོ།། །།བམ་པོ་གཉིས་པ།
en: Bodhisattvas memorize and recite the names of these bhagavān buddhas, and by reciting the Dharma discourse of the Three Sections three times during the day and three times at night, they renounce their pernicious faults and obtain samādhi.”

source: དེའི་ཚེ་ན་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ནང་དུ་ཡང་དག་འཇོག་ལས་ལངས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས།
en: On the same occasion, the venerable Upāli emerged from meditative seclusion and came to where the Bhagavān was staying. Upon arriving, he bowed his head at the feet of the Bhagavān, circumambulated him three times, and sat to one side.

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ན་བདག་གཅིག་པུ་དབེན་པར་མཆིས་ཏེ་ནང་དུ་ཡང་དག་བཞག་པ་ན་སེམས་ལ་ཡོངས་སུ་རྟོག་པ་འདི་ལྟ་བུ་འདི་སྐྱེས་ལགས་ཏེ།
en: The venerable Upāli then said to the Bhagavān, “Bhagavān, when I was in solitary meditative seclusion, this thought arose in my mind:

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་བ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ལ་ནི་སོ་སོར་ཐར་པའི་སྡོམ་པ་ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་ཡོངས་སུ་དག་པ་བཅས་ལ།
en: the Bhagavān has taught the followers of the Śrāvakayāna and the Pratyekabuddhayāna that the prātimokṣa vows are the pure training and superior ethical discipline.
